from interaction import *

triggers = {'вафля', 'боб', 'нота', 'вафльор', 'микола'}

word_to_num_ua = {
    'один': '1',
    'два': '2',
    'три': '3',
    'чотири': '4',
    'п\'ять': '5',
    'шість': '6',
    'сім': '7',
    'вісім': '8',
    'дев\'ять': '9',
    'десять': '10',
    'одинадцять': '11',
    'дванадцять': '12',
    'тринадцять': '13',
    'чотирнадцять': '14',
    'п\'ятнадцять': '15',
    'шістнадцять': '16',
    'сімнадцять': '17',
    'вісімнадцять': '18',
    'дев\'ятнадцять': '19',
    'двадцять': '20',
    'двадцять один': '21',
    'двадцять два': '22',
    'двадцять три': '23',
    'двадцять чотири': '24',
    'двадцять п\'ять': '25',
    'двадцять шість': '26',
    'двадцять сім': '27',
    'двадцять вісім': '28',
    'двадцять дев\'ять': '29',
    'тридцять': '30',
    'тридцять один': '31',
    'тридцять два': '32',
    'тридцять три': '33',
    'тридцять чотири': '34',
    'тридцять п\'ять': '35',
    'тридцять шість': '36',
    'тридцять сім': '37',
    'тридцять вісім': '38',
    'тридцять дев\'ять': '39',
    'сорок': '40',
    'сорок один': '41',
    'сорок два': '42',
    'сорок три': '43',
    'сорок чотири': '44',
    'сорок п\'ять': '45',
    'сорок шість': '46',
    'сорок сім': '47',
    'сорок вісім': '48',
    'сорок дев\'ять': '49',
    'п\'ятдесят': '50'
}

api_token = "e652fa6047045a695f7fc63a739b2647"


months_to_name = {
    '01': 'січень',
    '02': 'лютий',
    '03': 'березень',
    '04': 'квітень',
    '05': 'травень',
    '06': 'червень',
    '07': 'липень',
    '08': 'серпень',
    '09': 'вересень',
    '10': 'жовтень',
    '11': 'листопад',
    '12': 'грудень'
}


vocab = {
    'яка зараз погода':           'weather зараз гляну...',
    'яка температура на вулиці':  'weather іди подивись',
    'покажи температуру':         'weather дивись',
    'яка погода':                 'weather дивись',
    'яка погода на вулиці':       'weather дивись',
    'скільки градусів на вулиці': 'weather говори мовою чмо московське',
    'котра година':               'get_current_time зараз гляну...',
    'яка година':                 'get_current_time зараз гляну...',
    'скільки часу':               'get_current_time зараз гляну...',
    'Який сьогодні день':         'get_current_date зараз гляну...',
    'Що сьогодні за день':        'get_current_date зараз гляну...',
    'Яке сьогодні число':         'get_current_date зараз гляну...',
    'Яка дата':                   'get_current_date зараз гляну...',
    'є вільні місця':             'check_free_tables зараз гляну...',
    'є вільні столики':             'check_free_tables зараз гляну...',
    'є заброньовані місця':       'check_reserv_tables зараз гляну...',
    'є зарезервовані місця':      'check_reserv_tables зараз гляну...',
    'вільних місць':              'check_free_tables зараз гляну...',

    'можна замовити':             'take_order',
    'принеси ':                   'take_order',
    'додай':                      'take_order',
    'принесіть мені ':            'take_order',
    'можна мені замовити':        'take_order',
    'додай у замовлення':         'take_order',
    'можна ще':                   'take_order',
    'додай до замовлення':         'take_order',
    'додай ':                      'take_order',

    'Доброго ранку':              'skip Доброго ранку, чим можу допомогти',
    'Доброго дня':                'skip Доброго дня, чим можу допомогти',
    'Доброго вечора':             'skip Доброго вечора, чим можу допомогти',

    'отримати доступ до столику': 'table_access_get ',
    'можна взяти столик':         'table_access_get ',
    'можна використати столик':   'table_access_get ',
    'отримати доступ до столика': 'table_access_get ',

    'активація ключа': 'table_access_pass ',
    'застосування ключа для столика': 'table_access_pass ',

    'видали з замовлення': 'remove_from_order ',
    'прибери з замовлення': 'remove_from_order ',
    'вилучи з замовлення': 'remove_from_order ',
    'видали з кошика': 'remove_from_order ',
    'прибери з кошика': 'remove_from_order ',
    'вилучи з кошика': 'remove_from_order ',

    'можна переглянути замовлення': 'check_order ',
    'що ми замовили': 'check_order ',
    'чи можна подивитись замовлення': 'check_order ',
    'що у моєму замовленні': 'check_order ',

    'підтверджую замовлення': 'confirm_order ',
    'підтверджує замовлення': 'confirm_order ',
    'підтверджуємо замовлення': 'confirm_order ',
    'підтверджують замовлення': 'confirm_order ',

    'так': 'confirm_order ',
    'ні': 'confirm_order ',

    'закінчити сесію': 'end_session ',
    'завершити сесію': 'end_session ',
    'кінець сесії': 'end_session ',

    'можна меню':               'show_menu_list ',
    'де можна подивитись меню': 'show_menu_list ',
    'покажи меню':              'show_menu_list '




    
    
    }
